scsidirect 1.1 by Randell Jesup - use ? to get a list of commands

	Warning: there is little error checking in this program.
You could destroy all the data on your drive!
You HAVE been warned!
Opening device scsi.device, unit 0

scsidirect> ?
 ?  - list all commands
 quit  - exit this program
 Source <file> [echo] - read commands from file
 SetBuffer [offset] [hex <hex digits>]|<string>
 ShowBuffer [hex] [offset [length]] - show part of buffer
 Command <cmd len> <cmd bytes> <data offset> <data len> Read|Write
 FormatUnit <interleave>
	[pattern <modifier> <type> [<pattern>...]]
	[defects <format> [<defects>...] [disable_primary] [disable_certify]
	 [stop_format] [disable_page_save] [immediate]]
	[grown]
 Inquiry <page> <offset> <length> - get basic information
 LockUnlockCache <start block> <blocks> lock|unlock [relative]
 MediumRemoval prevent|allow - prevent or allow medium removal
 ModeSelect <offset> <length> - select parameters
 ModeSense <page> <type> <offset> <length> [noblock] - get parameters
 ModifyPage <page> <byte1> <value1> ... <byteN> <valueN> [save] [scsi2]
 Prefetch <start block> <blocks> [relative] [immed]
 Read <start block> <blocks> <offset>
 Read10 <start block> <blocks> <offset> [relative] [DPO] [force]
 ReadCapacity <starting block> [relative] [next_delay]
 ReadDefectData <offset> <len> <format> [primary] [grown]
 ReassignBlocks [block] ... - reassign a list of bad blocks
 RezeroUnit  - rezeros a unit (vender-specific results)
 ShowPage <page> [<type:0-4>] - show a page of mode data
 StartStopUnit start|stop [immed] [load_eject]n
 SynchronizeCache <start block> <blocks> [relative] [immed]
 TestUnitReady - determine if a unit is ready
 Verify <start block> <blocks> [relative] [bytecheck <offset>] [DPO]
 Write <start block> <blocks> <offset>
 Write10 <start block> <blocks> <offset> [relative] [DPO] [force]
 WriteVerify <start block> <blocks> <offset> [relative] [DPO] [check]
 <offset> refers to an offset into the buffer

scsidirect> inquiry 0 0 255
Peripheral connected and is specified by Device Type
Direct-access device (disk)
Media is not removable
Device type modifier: 0
ISO version:  0
ECMA version: 0
ANSI version: 2 (SCSI-2 device (X3.131-1990))
Device can't accept AENs
Doesn't support TERMINATE I/O message
Inquiry response format: 2 (SCSI-2 standard Inquiry format)
Relative addressing not supported
32-bit transfers not supported
16-bit transfers not supported
Synchronous transfers supported
Linked commands supported
Tagged command queuing supported
RST causes 'hard' reset
Vendor: SEAGATE 
Product: ST1480          
Revision: 4676
Vendor-specific bytes:
0036: 30 30 30 30 38 33 30 31 00 00 
0046: 00 00 00 00 00 00 00 00 00 00 
0096: 43 6f 70 79 72 69 67 68 74 20 
0106: 28 63 29 20 31 39 39 31 20 53 
0116: 65 61 67 61 74 65 20 20 41 6c 
0126: 6c 20 72 69 67 68 74 73 20 72 
0136: 65 73 65 72 76 65 64 20 30 30 
0146: 30 33 

scsidirect> showpage 1
page is saveable
Read-Write Error Recovery page:
	Don't Transfer before indicating unrecovered error
	Minimize miscorrection probability
	Don't report recovered errors
	Don't stop after recovered errors
	Use ECC for error correction
	Read Retry Count:		27
	Correction Span:		11
	Head Offset Count:		0
	Data Strobe Offset Count:	0
	Write Retry Count:		0
	Recovery Time Limit:	65535ms

scsidirect> modesense 1 1 0 255
Mode Sense returned 0

scsidirect> showbuffer hex

0000: 17 00 00 08 00 00 00 00 00 00 02 00 81 0a ff ff 00 00 00 00 
0020: 00 00 00 00 20 20 20 20 20 20 20 20 34 36 37 36 30 30 30 30 
0040: 38 33 30 31 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 
0060: 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 

scsidirect> prefetch 0 10
Sense code: 2 (Check Condition)
Sense key is 5 (Illegal Request)
Addition sense: 0x20, qualifier 0x0
invalid command operation code (command not supported)
Field Replacable Unit = 0
Error is in command bytes
Byte in error is 0

Command was: 34 00 00 00 00 00 00 00 0a 00 

0 data bytes transferred out of 8192


Raw Sense data: (18 bytes)
0000: 70 00 05 00 03 f4 66 0a 00 00 00 00 20 00 00 c0 
0010: 00 00 

scsidirect> showpage 2
page is saveable
Disconnect/Reconnect page:
	Buffer Full Ratio:		0%
	Buffer Empty Ratio:		0%
	Bus Inactivity Limit:		1.0ms
	Disconnect Time Limit:		0
	Connect Time Limit:		0
	Maximum Burst Size:		0 bytes
	Other parameters control disconnect

scsidirect> showpage 3
page is saveable
Format Device page:
	Tracks Per Zone:			1
	Alternate Sectors Per Zone:		1
	Alternate Tracks Per Zone:		0
	Alternate Tracks Per Logical Unit:	18
	Sectors per track:			64
	Data bytes per physical sector:		512
	Interleave:				1
	Track Skew Factor:			7
	Cylinder Skew Factor:			25
	Hard sector formatting only
	Media is fixed
	Formats by cylinder

scsidirect> showpage 4
page is saveable
Rigid Disk Geometry Page:
	Number of Cylinders:			1476
	Heads:					9
	Starting Cylinder-Write-Precompensation:0
	Starting Cylinder-Reduced Write Current:0
	Drive Step Rate:			0
	Landing Zone Cylinder:			0
	Rotational Offset:			0
	Rotation Rate:				17

scsidirect> showpage 7
page is saveable
Verify Error Recovery page:
	Minimize miscorrection probability
	Don't report recovered errors
	Don't stop after recovered errors
	Use ECC for error correction
	Verify Retry Count:		27
	Verify Correction Span:		11
	Verify Recovery Time Limit:	65535ms

scsidirect> showpage 8
page is saveable
Caching page:
	Read Retention Priority: 0x00
		No distinction
	Write Retention Priority: 0x00
		No distinction
	Disable Prefetch Transfer Length:	65535
	Minimum Prefetch:			0
	Maximum Prefetch:			30
	Maximum Prefetch Ceiling:		120

scsidirect> showpage 9
Peripheral Device page:

scsidirect> showpage 10
page is saveable
Control Mode page:
	Unrestricted re-ordering allowed
	Continue remaining commands in queue after command error
	Tagged queuing enabled
	Extended Contingent Allegiance disabled
	Target doesn't do AEN after initialization
	Target doesn't do AEN for a Unit Attention
	Target doesn't do AEN to report deferred errors
	Ready AEN Holdoff Period:	0ms

scsidirect> showpage 12 dump
Notch page:
	Normal SCSI-2 Page Len is 22, page len returned is 0

Byte  0: 0c
Byte  1: 00

scsidirect> showpage 56
page is saveable
Non-standard page

Byte  0: b8
Byte  1: 0e
Byte  2: d1
Byte  3: 00
Byte  4: 00
Byte  5: 00
Byte  6: 00
Byte  7: 00
Byte  8: 00
Byte  9: 00
Byte 10: 00
Byte 11: 00
Byte 12: 00
Byte 13: 00
Byte 14: 00
Byte 15: 00

scsidirect> quit
